Quiz3/Quiz3-Rails/app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by_id session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]