Quiz3/Quiz3-Rails/app/controllers/posts_controller.rb

  def index
    posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC